In [2]:
import pandas as pd
import numpy as np

## Example dataset

In [5]:
names = ['Jimmy', 'Tom', 'Mery', 'Anne', 'Olimpia']
incomes_k = [20,50,1000,100000]
SIZE = 50000

df = pd.DataFrame( 
    {
        'name': np.random.choice(names,size=SIZE),
        'age' : np.random.randint(0,100,size=SIZE),
        'income': np.random.choice(incomes_k,size=SIZE)
    })

In [15]:
df.head(3)

   age  income     name
0   41      50      Tom
1   43      20    Jimmy
2   36  100000  Olimpia

### Show a new derived 'Income' Series as logarithm of 10

In [16]:
df[['income']].apply(lambda x: np.log(x+1)/np.log(10)).head(3)

     income
0  1.707570
1  1.322219
2  5.000004

### Note that the original dataframe is not altered by the 'apply' method

In [14]:
df.head(3)

   age  income     name
0   41      50      Tom
1   43      20    Jimmy
2   36  100000  Olimpia